nxp-appcodehub/an-fxls8974cf-low-power-wake-up-examples/sdcd_motion_wakeup/shake_detection/frdmmcxn947/accel4_click/frdmmcxn947_a8974_click_shake_motion_wakeup/board/pin_mux.c
    /* FXLS8974CF INTF_SEL Pin */
    const port_pin_config_t port1_21_config      = {/* Internal pull-up/down resistor is disabled */
													kPORT_PullDisable,
													/* Low internal pull resistor value is selected. */
													kPORT_LowPullResistor,
													/* Fast slew rate is configured */
													kPORT_FastSlewRate,
													/* Passive input filter is disabled */
													kPORT_PassiveFilterDisable,
													/* Open drain output is disabled */
													kPORT_OpenDrainDisable,
													/* Low drive strength is configured */
													kPORT_LowDriveStrength,
													/* Pin is configured as PIO3_4 */
													kPORT_MuxAlt0,
													/* Digital input enabled */
													kPORT_InputBufferEnable,
													/* Digital input is not inverted */
													kPORT_InputNormal,
													/* Pin Control Register fields [15:0] are not locked */
													kPORT_UnlockRegister};
    /* PORT1_21 is configured */
    PORT_SetPinConfig(PORT1, 21U, &port1_21_config);

    /* FXLS8974CF BT_MODE Pin */
    const port_pin_config_t port1_2_config        = {/* Internal pull-up/down resistor is disabled */
													kPORT_PullDisable,
													/* Low internal pull resistor value is selected. */
													kPORT_LowPullResistor,
													/* Fast slew rate is configured */
													kPORT_FastSlewRate,
													/* Passive input filter is disabled */
													kPORT_PassiveFilterDisable,
													/* Open drain output is disabled */
													kPORT_OpenDrainDisable,
													/* Low drive strength is configured */
													kPORT_LowDriveStrength,
													/* Pin is configured as PIO3_4 */
													kPORT_MuxAlt0,
													/* Digital input enabled */
													kPORT_InputBufferEnable,
													/* Digital input is not inverted */
													kPORT_InputNormal,
													/* Pin Control Register fields [15:0] are not locked */
													kPORT_UnlockRegister};
    /* PORT1_2 is configured */
    PORT_SetPinConfig(PORT1, 2U, &port1_2_config);

    const port_pin_config_t port4_12_pinT6_config = {/* Internal pull-up/down resistor is disabled */
    		                                         kPORT_PullUp,
                                                     /* Low internal pull resistor value is selected. */
													 kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Pin is configured as OPAMP0_INP0 */
                                                     kPORT_MuxAlt0,
                                                     /* Digital input disabled; it is required for analog functions */
                                                     kPORT_InputBufferDisable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT4_12 (pin T6) is configured as P4_12 */
    PORT_SetPinConfig(PORT4, 12U, &port4_12_pinT6_config);

    const port_pin_config_t port1_8_pinA1_config = {/* Internal pull-up/down resistor is disabled */
                                                    kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as FC4_P0 */
                                                    kPORT_MuxAlt2,
                                                    /* Digital input enabled */
                                                    kPORT_InputBufferEnable,
                                                    /* Digital input is not inverted */
                                                    kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORT1_8 (pin A1) is configured as FC4_P0 */
    PORT_SetPinConfig(PORT1, 8U, &port1_8_pinA1_config);

    const port_pin_config_t port1_9_pinB1_config = {/* Internal pull-up/down resistor is disabled */
                                                    kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as FC4_P1 */
                                                    kPORT_MuxAlt2,
                                                    /* Digital input enabled */
                                                    kPORT_InputBufferEnable,
                                                    /* Digital input is not inverted */
                                                    kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORT1_9 (pin B1) is configured as FC4_P1 */
    PORT_SetPinConfig(PORT1, 9U, &port1_9_pinB1_config);

    /* PORT1_0 (pin C6) is configured as FC3_P0 */
    PORT_SetPinMux(PORT1, 0U, kPORT_MuxAlt2);

    PORT1->PCR[0] = ((PORT1->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_ODE_MASK | PORT_PCR_IBE_MASK)))

